cls 
:menu
:start
@echo off&title 批处理模拟进度条
::::■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■
::::■〓■〓■〓■〓■       开启变量延迟      ■〓■〓■〓■〓■
::::■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■
setlocal enabledelayedexpansion
::::■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■
::::■〓■     说明：                                                           ■〓■
::::■〓■     变量 a1 用于 显示完成 百分比                    ■〓■
::::■〓■     变量 b1 用于 显示 进度条 >                        ■〓■
::::■〓■     变量 c1 用于 子程序完成百分比自增量         ■〓■
::::■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■
echo.
::::■〓■〓■〓■〓■   程序初始化开始   ■〓■〓■〓■〓■
color 0a
echo.
echo. >xsp1.txt
echo. >xsp2.txt
echo   显示xsp1.txt文件里面的内容。>>xsp1.txt
echo   显示xsp2.txt文件里面的内容。>>xsp2.txt
set xsp=xsp1.txt
echo.
set /a c1=0
::::■〓■〓■〓■〓■   完成程序初始化   ■〓■〓■〓■〓■
echo.
::::■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■
::::■〓■     说明：                                                            ■〓■
::::■〓■     每调用一次子程序:sub模拟进度条增加1%    ■〓■
::::■〓■     调用子程序 的 命令 格式 为 :                      ■〓■
::::■〓■       call :sub                                                           ■〓■
::::■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■〓■
::::◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆
rem   下面◆◇◆◇◆区域内可以插入要调研本模拟进度条的其他主程序
rem   把其他主程序的显示内容用>或>>，分别交错写入到xsp1.txt或xsp1.txt里
rem   即当用type %xsp%显示xsp1.txt内容时，把其他主程序的显示内容用>或>>写入到xsp2.txt
rem   当用type %xsp%显示xsp2.txt内容时，把其他主程序的显示内容用>或>>写入到xsp1.txt里
rem   用set xsp=xsp1.txt或set xsp=xsp2.txt来循环变换type %xsp%所显示的内容。
::::◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆
echo.
for /l %%i in (1 1 100) do call :sub

::::◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆
::::■〓■〓■〓■〓■   开始删除本程序生成的临时文件   ■〓■〓■〓■〓■
del xsp1.txt
del xsp2.txt
::::■〓■〓■〓■〓■本程序生成的临时文件全部删除完毕■〓■〓■〓■〓■
pause



rem   ■〓■〓■下面是模拟进度条的子程序■〓■〓■
:sub
rem   --------------------------------------------
rem   set /a c1= %c1% + 1   命令简写如下：
set /a c1+=1
rem   --------------------------------------------
set /a a1=%c1%
cls && for /l %%n in (1 1 20) do echo.
rem   显示变量xsp代表的文件里面的内容，即xsp1.txt或xsp1.txt里的内容。
type %xsp%
echo.
echo.
echo.
echo 请耐心等待，已完成 !a1! %%
rem   变量b1启用变量延迟效果后，把变量b1原来的值加上>符号后，在赋值给变量b1
set b1=!b1!^>&& echo !b1!
ping /n 1 127.0.0.1>nul
rem cls

goto :eof

exit